Revit 2027 API
DirectShapeType.AddReferencePoint Method
Overload List
Name | Description
AddReferencePoint(XYZ) |  Adds a reference point to the DirectShapeType.
AddReferencePoint(XYZ, DirectShapeReferenceOptions) |  Adds a reference point to the DirectShapeType.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace